"use strict";
// TASK 2    let userMassMax = prompt("Please enter your max number: ");
// let maxNum = 0;
// let minNum = Infinity;
// for (let i = 0; userMassMax > i; i++) {
//   let userMassCount = +prompt("Please enter value: ");

//   if (maxNum <= userMassCount) {
//     maxNum = userMassCount;
//   }

//   if (minNum > userMassCount) {
//     minNum = userMassCount;
//   }
// }
// console.log(`Максимальне значення: ${maxNum}, Мінімальне значення: ${minNum}`);## TASK 3

// Виведіть таблицю множення для числа, яке користувач введе з клавіатури. Виводити в форматі
// x * 1 =
// x * 2 =
// x * 3 =
// ... кожен запис з нового рядка.

// let value = prompt("Введіть число від 1-9");
// let result = 0;
// for (let i = 1; i <= 9; i++) {
//     result = value * i
//     console.log(`${value} * ${i} = ${result}`);
// }

// ## TASK 4

// Створити таймер зворотнього відліку. Запитати у користувача число з якого рахуємо.
// Перевірити, чи введене значення є саме числом.
// На початку відліку вивести в консоль Починаємо відлік 📣.
// Вивести в консоль всі числа від введеного до 0 в форматі:
// ✅ Зворотній відлік: ${значення}.
// По закінченню відліку написати 🌞 Зворотній відлік з ${значення} до 0 закінчено.