/*Теоретичні питання
1. Що таке оператори в JavaScript і які їхні типи ви знаєте?
2. Для чого використовуються оператори порівняння в JavaScript? Наведіть приклади таких операторів.
3. Що таке операції присвоєння в JavaScript? Наведіть кілька прикладів операцій присвоєння.
Відповідь на теоритичні питання
1. Є багато видів операторів , але основні : арифметичні , присвоєння , порівняльні та логічні . Вони використовуються для операцій операндів (для того , що б гратись з змінними).
2. Порівняння в джаваскрипті обертається в булеву функцію true або false , вони дозволяють визначити чи є написане вірним чи ні.
console.log(5 == "5");   // true це не строге порівняння яке порівнює те що написане
console.log(5 === "5");  // false а це строге порівняння яке порівнює і тип данних і те що написано в даному випадку 5 це намбер а 5 в лапках це стрінг
3. Операції присвоєння це коли людина яка пише код змінній каже що вона буде дорівнювати тому , чому вона скаже ,
до прикладу let number = 5 , змінній number ПРИСВОЇЛИ чило 5 , а у цьому прикладі let string = "5" змінній string ПРИСВОЇЛИ текст 5


Практичні завдання
1. Створіть змінну "username" і присвойте їй ваше ім'я. Створіть змінну "password" і присвойте їй пароль (наприклад, "secret").
Далі ми імітуємо введеня паролю користувачем. Отримайте від користувача значення його паролю і перевірте, чи співпадає воно зі значенням в змінній "password".
Виведіть результат порівнння в консоль.
2. Створіть змінну x та присвойте їй значення 5. Створіть ще одну змінну y та запишіть присвойте їй значення 3.
Виведіть результати додавання, віднімання, множення та ділення
змінних x та y у вікні alert.*/
// Практичні завдання
// 1. завдання

// let username = "maxim";
// let password = "secret";
// const writePassword = prompt("уведіть пароль :");
// console.log(writePassword == password);



// 2. завдання

// let x = 5;
// let y = 3;
// alert(`"x = 5 , y = 3 . x + y = " ${ x + y}`);
// alert(`"x = 5 , y = 3 . x - y = " ${ x - y}`);
// alert(`"x = 5 , y = 3 . x * y = " ${ x * y}`);
// alert(`"x = 5 , y = 3 . x / y = " ${ x / y}`);
