/*
 Теоретичні питання
 1. Що таке логічний оператор?
 2. Які логічні оператори є в JavaScript і які їх символи?

// 1 Логічні оператори це символи ,
які використовуються для порівняння логічних операцій між двома або більшою кількістю значень,
які переходять в булевий результат.
//  2 Є логічні оператори:
&&(і,  він використовується для того що б перераховувати умови),
|| (або , використовується для повернення ),
! (не, повертає false на true або навпаки),
!== (логічне не рівно, якщо операнди не рівні за значенням або типом повертає в false),
=== (логічне рівно, повертає true , якщо операнди рівні за типом та значенням , якщо ні то false)
 Практичні завдання.
 1. Попросіть користувача ввести свій вік за допомогою prompt.
 Якщо вік менше 12 років, виведіть у вікні alert повідомлення про те,
 що він є дитиною, якщо вік менше 18 років, виведіть повідомлення про те,
 що він є підлітком, інакше виведіть повідомлення про те, що він є дорослим.

 Завдання з підвищенною складністю.
 Перевірте чи ввів користувач саме число в поле prompt. Якщо ні, то виведіть повідомлення, що введено не число.

 2. Напишіть програму, яка запитує у користувача місяць року (українською мовою маленкими літерами) та виводить повідомлення,
 скільки днів у цьому місяці. Результат виводиться в консоль.
 Скільки днів в кожному місяці можна знайти тут в розділі Юліанський і Григоріанський календарі - https://uk.wikipedia.org/wiki/%D0%9C%D1%96%D1%81%D1%8F%D1%86%D1%8C_(%D1%87%D0%B0%D1%81)
 (Використайте switch case)
 */

// Практичне завдання  1 (виконано з підвищеною складністю)
// "use strict";
// const age = prompt("Введыть свій вік");
// if (age !== null && age !== "" && !isNaN(age)) {
//     if (age < 12) {
//         alert("Ви дитина");
//     }
//     else if (age >= 12 && age < 18) {
//         alert("Ви підліток");
//     }
//     else if (age >= 18) {
//         alert("Ви дорослий ");
//     }

// } else { alert("введено не число") }

// Практичне завдання  2
// "use strict";
// const month = prompt("Введіть назву місяця маленькими літерами");
// let days;
// switch (month) {
//     case "січень":
//         days = 31;
//         break;
//     case "лютий":
//         days = "28 або 29";
//         break;
//     case "березень":
//         days = 31;
//         break;
//     case "квітень":
//         days = 30;
//         break;
//     case "травень":
//         days = 31;
//         break;
//     case "червень":
//         days = 30;
//         break;
//     case "липень":
//         days = 31;
//         break;
//     case "серпень":
//         days = 31;
//         break;
//     case "вересень":
//         days = 30;
//         break;
//     case "жовтень":
//         days = 31;
//         break;
//     case "листопад":
//         days = 30;
//         break;
//     case "грудень":
//         days = 31;
//         break;
//     default: console.log("Не правильна назва місяця")
// }
// if (days !== undefined) {
//     console.log(`Місяць ${month} має ${days} днів`);
// }