/* 
 Теоретичні питання
 1. Що таке цикл в програмуванні?
 2. Які види циклів є в JavaScript і які їх ключові слова?
 3. Чим відрізняється цикл do while від while?

 Практичні завдання
 1. Запитайте у користувача два числа. 
 Перевірте, чи є кожне з введених значень числом. 
 Якщо ні, то запитуйте у користувача нове занчення до тих пір, поки воно не буде числом. 
 Виведіть на екран всі числа від меншого до більшого за допомогою циклу for. 

 2. Напишіть програму, яка запитує в користувача число та перевіряє, 
 чи воно є парним числом. Якщо введене значення не є парним числом, 
 то запитуйте число доки користувач не введе правильне значення.
*/
/*Теоретичні питання 

  Питання 1
  Цикл це те що виконує якусь дію до того моменту поки умова не буде виконана , якщо ні , то цикл буде повторюватись.

  Питання 2
  У JavaScript мені відомо про 3 цикли : for , while , do while.

  Питання 3
  Цикл while і do while схожі за назввами, 
  але цикл while отримує умову і одразу перевіряє її до того моменту поки не виконається, 
  може навіть не виконатись без правильно умови.
  Цикл do while, 
  спочатку do виконує дію,
  а післня нього перевіряється умова,
  якщо  умова вірна іде продовження коду, 
  якщо навпаки то цикл завершується.
*/

// Практичне завдання 1
// let firstNumber = prompt("Введіть перше число");

// for (;;) {
//   if (!isNaN(firstNumber)) {
//     break;
//   } else {
//     firstNumber = prompt("Введіть перше коректне число");
//   }
// }let secondNumber = prompt("Введіть друге число");
// for (;;) {
//   if (!isNaN(secondNumber)) {
//     break;
//   } else {
//     secondNumber = prompt("Введіть друге коректне число");
//   }
// }
// let start, end;
// if (firstNumber < secondNumber) {
//   start = firstNumber;
//   end =secondNumber ;
// } else {
//   start =secondNumber;
//   end = firstNumber ;
// }
// console.log(start,end)

// Практичне завдання 2
// let value = prompt("Введіть парне число");
// if (!isNaN(value)) {
//   for (;;) {
//     if (value % 2 == 0) {
//       break;
//     } else {
//       value = prompt("Повторюсь введіть парне число");
//     }
//   }
//   alert("Число є парним)");
// } else {
//   value = prompt("Введіть парне число");
// }
